Revit 2027 API
TransactionGroup.GetStatus Method
 Gets the current status of the transaction group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TransactionStatus GetStatus()
Public Function GetStatus As TransactionStatus
public:
TransactionStatus GetStatus()
member GetStatus : unit -> TransactionStatus
Return Value
TransactionStatus
 The current status of the transaction group.
See Also
Reference
TransactionGroup Class
Autodesk.Revit.DB Namespace